In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from scipy import stats

import warnings
warnings.filterwarnings("ignore")
 
%matplotlib inline

In [4]:
"""
读取数据集
"""
test_data = pd.read_csv('/machine-learning/datasets/tmall/data_format1/test_format1.csv')
train_data = pd.read_csv('/machine-learning/datasets/tmall/data_format1/train_format1.csv')

user_info = pd.read_csv('/machine-learning/datasets/tmall/data_format1/user_info_format1.csv')
user_log = pd.read_csv('/machine-learning/datasets/tmall/data_format1/user_log_format1.csv')

#user_info = pd.read_csv('./data_format1/user_info_format1.csv').drop_duplicates()
#user_log = pd.read_csv('./data_format1/user_log_format1.csv').rename(columns={"seller_id":'merchant_id'})

In [5]:
train_data.head(3)

   user_id  merchant_id  label
0    34176         3906      0
1    34176          121      0
2    34176         4356      1

In [6]:
test_data.head(5)

   user_id  merchant_id  prob
0   163968         4605   NaN
1   360576         1581   NaN
2    98688         1964   NaN
3    98688         3645   NaN
4   295296         3361   NaN

In [7]:
user_info.head(5)

   user_id  age_range  gender
0   376517        6.0     1.0
1   234512        5.0     0.0
2   344532        5.0     0.0
3   186135        5.0     0.0
4    30230        5.0     0.0

In [8]:
user_log.head(5)

   user_id  item_id  cat_id  seller_id  brand_id  time_stamp  action_type
0   328862   323294     833       2882    2661.0         829            0
1   328862   844400    1271       2882    2661.0         829            0
2   328862   575153    1271       2882    2661.0         829            0
3   328862   996875    1271       2882    2661.0         829            0
4   328862  1086186    1271       1253    1049.0         829            0

In [9]:
user_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 424170 entries, 0 to 424169
Data columns (total 3 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   user_id    424170 non-null  int64
 1   age_range  421953 non-null  float64
 2   gender     417734 non-null  float64
dtypes: float64(2), int64(1)
memory usage: 9.7 MB

In [10]:
user_log.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54925330 entries, 0 to 54925329
Data columns (total 7 columns):
 #   Column       Dtype
---  ------       -----
 0   user_id      int64
 1   item_id      int64
 2   cat_id       int64
 3   seller_id    int64
 4   brand_id     float64
 5   time_stamp   int64
 6   action_type  int64
dtypes: float64(1), int64(6)
memory usage: 2.9 GB

In [11]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 260864 entries, 0 to 260863
Data columns (total 3 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   user_id      260864 non-null  int64
 1   merchant_id  260864 non-null  int64
 2   label        260864 non-null  int64
dtypes: int64(3)
memory usage: 6.0 MB

In [20]:
# 年龄缺失比例
(user_info.shape[0] - user_info['age_range'].count())/user_info.shape[0]

0.005226677982884221

In [25]:
user_info[user_info['age_range'].isna() | (user_info['age_range'] == 0)].count()

user_id      95131
age_range    92914
gender       90664
dtype: int64

In [30]:
user_info.groupby(['age_range'])[['user_id']].count()

           user_id
age_range
0.0          92914
1.0             24
2.0          52871
3.0         111654
4.0          79991
5.0          40777
6.0          35464
7.0           6992
8.0           1266

In [40]:
user_info[user_info['age_range'] == 0.0].shape

(92914, 3)

In [41]:
user_info[user_info['age_range'] == 1.0].shape

(24, 3)

In [50]:
# 性别缺失比例
(user_info.shape[0] - user_info['gender'].count())/user_info.shape[0]

0.01517316170403376

In [51]:
user_info[user_info['gender'].isna() | (user_info['gender'] == 2)].head(5)

    user_id  age_range  gender
10   149002        5.0     2.0
42   116591        4.0     2.0
47   182794        6.0     2.0
55    97984        5.0     2.0
72    15868        5.0     2.0

In [49]:
user_info[user_info['gender'].isna() | (user_info['gender'] == 2)].count()

user_id      16862
age_range    14664
gender       10426
dtype: int64

In [47]:
user_info.groupby(['gender'])[['user_id']].count()

        user_id
gender
0.0      285638
1.0      121670
2.0       10426

In [ ]:
user_info[user_info['age_range'].isna() | (user_info['age_range'] == 0)]